# ControlTest_1
## **ИТОГОВАЯ ПРОВЕРОЧНАЯ РАБОТА ПО ПЕРВОМУ КУРСУ**
----

### _**Задание**_:

1. Создать репозиторий на GitHub.
2. Нарисовать блок-схему алгоритма.
3. Снабдить репозиторий оформленным текстовым   описанием решения (файл README.md).
4. Написать программу, решающую поставленную задачу.
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что все залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах).

### _**Текст задачи**_:

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решение не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

---

## **РЕШЕНИЕ**
---

1. [Ссылка на репозиторий:](https://github.com/elenakrivobokova/ControlTest_1 "Нажмите для перехода").
2. Блок-схема алгоритма находится на файле "Schema.pdf".
3. Описание решения задачи на языке C#:

+ _Просим пользователя ввести с клавиатуры строки через пробел (элементы массива)_:

```C#
string ReadStr(string text) 
{
    Console.WriteLine(text);
    return Console.ReadLine();
}
```
+ _Преобразуем введенные строки в массив строк_:

```C#
string[] GenerateFirstArray(string str) 
{
    string[] arr = stroka.Split(' ');
    return arr;
}
```
+ _Задаем цикл через for и проверяем каждый элемент (строку) массива по условию "длина строки меньше либо равна 3 символа". Строки, отвечающие условию, записываются в новый финальный массив, который выводится в терминале_:

```C#
void ResultArray(string[] arr)
{
    string[] newArr = new string[arr.Length];
    int count = 0;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i].Length <= 3)
        {
            newArr[count] = array1[i];
            count++;
        }
    }
    System.Console.WriteLine("[" + string.Join(",", newArr) + "]");
}
```
4. Программа на C# расположена в папке Task.
5. Ход выполнения итоговой проверочной работы фиксировался в коммитах.
--- 



